1s/ERP/extensions/liko/DataProcessors/РабочееМестоРаботникаСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РабочееМестоРаботникаСклада</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КРазмещению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Паллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Адреса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ЗаявкаНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/СтатусыОтборовРазмещенийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыОтборовРазмещенийТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыполненоБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыполненоСОшибками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/DataProcessors/РабочееМестоРаботникаСклада/Forms/Лико_ФормаРабочегоМеста_320х320/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ



#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	
	Если Параметры.Свойство("ДокументОсонвание") Тогда
		ДокументОснование=Параметры.ДокументОснование;
	КонецЕсли;	
	Организация = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", ПараметрыСеанса.ТекущийПользователь);
	ИндексТекущейСтраницы=0;
	Структура = Новый Структура;
	Структура.Вставить("МестоХранения","Необходимо указать место хранения!");
	Структура.Вставить("ОтсутствиеТовара","На складе: %Склад% товара: %товар% нет в наличии! ");
	СоответствиеСсобщений=Структура;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// МеханизмВнешнегоОборудования
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(
	Новый ОписаниеОповещения("НачатьПодключениеОборудованиеПриОткрытииФормыЗавершение", ЭтотОбъект),
	ЭтотОбъект,
	"СканерШтрихкода");	
	ИндексТекущейСтраницы=0;
	ОтобразитьСтраницу("");
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			СтруктураШтрихКода= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			
			ДокОснование=ПолучитьСсылкуПоШтрихкодуТабличногоДокументаСервер(СтруктураШтрихКода.Штрихкод);
			Если ДокОснование<>Неопределено Тогда
				ДокументОснование=ДокОснование;
				ЗаполнитьПоДокументу();
				ИндексТекущейСтраницы=1;
				ОтобразитьСтраницу("");				
				Возврат;
			КонецЕсли; 
			Если ИндексТекущейСтраницы<>0 Тогда
				ОбработатьШтрихкоды(СтруктураШтрихКода);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры


#КонецОбласти

#Область КомандыФормы
&НаКлиенте
Процедура ЗакрытьИПровести(Команда)
	ЗакрытьИПровестиНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Если ИндексТекущейСтраницы=0 Тогда
		Закрыть();
	Иначе
		ИндексТекущейСтраницы=0;
		ОтобразитьСтраницу(""); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СканированиеДалее(Команда)
	ОтобразитьСтраницу("Далее");
КонецПроцедуры


&НаКлиенте
Процедура СканированиеНазад(Команда)
	ОтобразитьСтраницу( "Назад")
КонецПроцедуры



&НаКлиенте
Процедура Старт(Команда)
	ОтобразитьСтраницу("Далее");	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода) 	
	ТипОперацииСервер();
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			Оператор = Результат.Сотрудник;
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
			ОтобразитьСтраницу("");
		ИначеЕсли Результат.ВидШК =  ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ Результат.ВидШК =  ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//Это ячейка
			Ячейка = Результат.АдресаХранения;
			Склад = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.АдресаХранения,"Владелец");
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
			ОтобразитьСтраницу(""); 
		ИначеЕсли Результат.ВидШК =  ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") 
			Или Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий")   Тогда
			
			ОбработатьШтрихкодыНоменклатуры(Результат,ТипОперации);
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

#Область ШтрихкодНоменклатуры


&НаКлиенте
Процедура ОбработатьШтрихкодыНоменклатуры(Знач Результат,ТипОперации)
	Если ТипОперации="" Тогда 
		Возврат;
	КонецЕсли;
	
	
	Если ТипОперации="Перемещение" Тогда 	
		ОбработатьШтрихкодыНоменклатурыПеремещение(Результат);
	КонецЕсли;
	
	Если ТипОперации="Отбор" Тогда 	
		ОбработатьШтрихкодыНоменклатурыОтбор(Результат);
	КонецЕсли;
	
	Если ТипОперации="Инвентаризация" Тогда 	
		ОбработатьШтрихкодыНоменклатурыПеремещение(Результат);
	КонецЕсли; 	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыНоменклатурыПеремещение(Знач Результат)	
	
	Если Не ЗначениеЗаполнено(Ячейка) Тогда		
		ВывестиОшибку(СоответствиеСсобщений["МестоХранения"]);
		Возврат;
	КонецЕсли;
	
	
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Номенклатура"));
	Структура.Вставить("Серия",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Серия"));
	Структура.Вставить("Упаковка",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"БазоваяЕдиницаИзмерения"));
	Структура.Вставить("Характеристика",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Характеристика"));
	//Структура.Вставить("НомерПоставки",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"НомерПоставки"));
	Структура.Вставить("КоличествоУпаковок",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Количество"));
	ТекстОшибки=ЕстьНаСкладе(Структура,Склад);
	
	Если ТекстОшибки<>"" Тогда
		
		ВывестиОшибку(ТекстОшибки); 		
		Возврат;
	КонецЕсли;
	
	
	
	НайденныеСтроки=ТоварыДляСканирования.НайтиСтроки(Структура);
	Если НайденныеСтроки.Количество()>0 Тогда
		Для каждого НайденаяСтрока Из НайденныеСтроки  Цикл 	
			НайденаяСтрока.Ячейка=Ячейка; 						
		КонецЦикла;
	Иначе
		НоваяСтрока= ТоварыДляСканирования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Структура);
		НоваяСтрока.Ячейка=Ячейка;
		НоваяСтрока.НоменклатураИмя=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Структура.Серия,"Наименование");
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьВесОбъем");
		
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
		СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
		Суффикс = "";
		
		СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
		//СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс","Отобрано");
		
		//СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий.Отбор));
		
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс","Размещено"); 				
		
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		НоваяСтрока.КоличествоРазмещено=НоваяСтрока.Количество;	
		НоваяСтрока.КоличествоОтобрано=НоваяСтрока.Количество;	
		
		НоваяСтрока.КоличествоУпаковокРазмещено=НоваяСтрока.КоличествоУпаковок;	
		НоваяСтрока.КоличествоУпаковокОтобрано=НоваяСтрока.КоличествоУпаковок;	
		НоваяСтрока.СтатусУказанияСерий=8;	
	КонецЕсли;
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
	ОтобразитьСтраницу("");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыНоменклатурыОтбор(Знач Результат)	
	
	//Если Не ЗначениеЗаполнено(Ячейка) Тогда		
	//	ВывестиОшибку(СоответствиеСсобщений["МестоХранения"]);
	//	Возврат;
	//КонецЕсли;
	
	
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Номенклатура"));
	Структура.Вставить("Серия",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Серия"));
	Структура.Вставить("Упаковка",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"БазоваяЕдиницаИзмерения"));
	Структура.Вставить("Характеристика",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Характеристика"));
	//Структура.Вставить("НомерПоставки",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"НомерПоставки"));
	Структура.Вставить("КоличествоУпаковок",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Количество"));
	
	ДанныеПоСкладу=ЕстьНаСкладе(Структура,Склад);
		
	ТекстОшибки		=ДанныеПоСкладу.ТекстСообщения;
	ТоварыНаскладе	=ДанныеПоСкладу.таблица;
	
	
	Если ТекстОшибки<>"" Тогда		
		ВывестиОшибку(ТекстОшибки); 		
		Возврат;
	КонецЕсли;
	
	
	
	НайденныеСтроки=ТоварыДляСканирования.НайтиСтроки(Структура);
	Если НайденныеСтроки.Количество()>0 Тогда
		Для каждого НайденаяСтрока Из НайденныеСтроки  Цикл 	
			НайденаяСтрока.КоличествоУпаковокОтобрано=НайденаяСтрока.КоличествоУпаковок;
			НайденаяСтрока.КоличествоОтобрано=НайденаяСтрока.Количество;
			НайденаяСтрока.ЯчейкаТекущееХранение=НайденаяСтрока.Ячейка;
		КонецЦикла;
	Иначе
		НоваяСтрока= ТоварыДляСканирования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Структура);
		НоваяСтрока.Ячейка=Ячейка;
		НоваяСтрока.НоменклатураИмя=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Структура.Серия,"Наименование");
		
		//СтруктураДействий = Новый Структура;
		//СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		//СтруктураДействий.Вставить("ПересчитатьВесОбъем");
		
		
		//	СтруктураДействий = Новый Структура;
		//	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
		//	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
		//	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
		//	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
		//	Суффикс = "";
		//	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
		//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс","Отобрано");
		//	
		//
		//	
		//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс","Размещено"); 				
		//	
		//	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		
		
		//НоваяСтрока.КоличествоУпаковокРазмещено=НоваяСтрока.КоличествоУпаковок;	
		НоваяСтрока.КоличествоУпаковокОтобрано=НоваяСтрока.КоличествоУпаковок;	
		//НоваяСтрока.СтатусУказанияСерий=8;	
	КонецЕсли;
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
	ОтобразитьСтраницу("");
	
КонецПроцедуры



&НаКлиенте
Процедура ВывестиОшибку(Сообщение)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСообщения;
	Элементы.ТекстСообщения.Заголовок=Сообщение ;
	Если ИндексТекущейСтраницы<>4 Тогда
		ИндексПердыдущейСтраницы=ИндексТекущейСтраницы;			
	КонецЕсли;
	ОтобразитьСтраницу(""); 	
	Возврат;
	
КонецПроцедуры



#КонецОбласти

#Область Проведение


&НаСервере
Процедура ЗакрытьИПровестиНаСервере()
	
	ПровестиДокументОтборРазмещение_Перемещение();
	
	ПровестиДокументОтборРазмещение_Отбор();
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументОтборРазмещение_Перемещение()
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ=Ложь;	
	
	
	РезультатЗапроса = ТекущееМестоХранениеТоваров(); 
	
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Для каждого Товар Из ТоварыДляСканирования  Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",Товар.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика",Товар.Характеристика);
		СтруктураПоиска.Вставить("Серия",Товар.Серия); 		
		НайДенныеСтрокиТЗ= ТЗ.НайтиСтроки(СтруктураПоиска);		
		Если  НайденныеСтрокиТЗ.Количество()>0 тогда 			
			Для каждого НайденаяСтрока Из НайДенныеСтрокиТЗ  Цикл
				Товар.ЯчейкаТекущееХранение=НайденаяСтрока.Ячейка; 			
			КонецЦикла; 			
		КонецЕсли;		
	КонецЦикла;
	
	Док=Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	Док.Дата=ТекущаяДата();
	Док.ВидОперации=Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение;
	Док.Ответственный=Оператор;
	Док.Склад=Склад;
	Док.Статус=Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
	
	Для каждого Товар Из ТоварыДляСканирования  Цикл
		Отбор=Док.ТоварыОтбор.Добавить();
		ЗаполнитьЗначенияСвойств(Отбор,Товар);
		Отбор.Ячейка=Товар.ЯчейкаТекущееХранение;
		Размещение=Док.ТоварыРазмещение.Добавить();
		ЗаполнитьЗначенияСвойств(Размещение,Товар);
		
	КонецЦикла;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры



&НаСервере
Процедура ПровестиДокументОтборРазмещение_Отбор()
	
	Если Не (ЗначениеЗаполнено(ДокументОснование) и 
		ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ОтборРазмещениеТоваров") и
		ДокументОснование.ВидОперации=Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ=Ложь;	
	
	
	РезультатЗапроса = ТекущееМестоХранениеТоваров(); 
	
	
	//ТЗ = РезультатЗапроса.Выгрузить();
	//Для каждого Товар Из ТоварыДляСканирования  Цикл
	//	СтруктураПоиска = Новый Структура;
	//	СтруктураПоиска.Вставить("Номенклатура",Товар.Номенклатура);
	//	СтруктураПоиска.Вставить("Характеристика",Товар.Характеристика);
	//	СтруктураПоиска.Вставить("Серия",Товар.Серия); 		
	//	НайДенныеСтрокиТЗ= ТЗ.НайтиСтроки(СтруктураПоиска);		
	//	Если  НайденныеСтрокиТЗ.Количество()>0 тогда 			
	//		Для каждого НайденаяСтрока Из НайДенныеСтрокиТЗ  Цикл
	//			Товар.ЯчейкаТекущееХранение=НайденаяСтрока.Ячейка; 			
	//		КонецЦикла; 			
	//	КонецЕсли;		
	//КонецЦикла;
	
	//Док=Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	Док=ДокументОснование.ПолучитьОбъект();
	Док.Дата=ТекущаяДата();
	Док.ВидОперации=Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор;
	Док.Ответственный=Оператор;
	Док.Склад=Склад;
	Док.Статус=Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
    Док.ТоварыОтбор.Очистить();
	
	Для каждого Товар Из ТоварыДляСканирования  Цикл
		Отбор=Док.ТоварыОтбор.Добавить();
		ЗаполнитьЗначенияСвойств(Отбор,Товар);
		//Отбор.Ячейка=Товар.ЯчейкаТекущееХранение;
		//Размещение=Док.ТоварыРазмещение.Добавить();
		//ЗаполнитьЗначенияСвойств(Размещение,Товар);
		
	КонецЦикла;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры




#КонецОбласти

&НаСервере
Функция ТекущееМестоХранениеТоваров()
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Ячейка) КАК Ячейка,
	|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	|	СУММА(1) КАК КоличествоЯчеек
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Ячейка.Владелец = &Склад
	|					И (Номенклатура, Серия, Характеристика) В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВтТовары.Номенклатура КАК Номенклатура,
	|							ВтТовары.Серия КАК Серия,
	|							ВтТовары.Характеристика КАК Характеристика
	|						ИЗ
	|							ВтТовары КАК ВтТовары)) КАК ТоварыВЯчейкахОстатки
	|		ПО ВтТовары.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|			И ВтТовары.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
	|			И ВтТовары.Серия = ТоварыВЯчейкахОстатки.Серия
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Серия";
	Запрос.УстановитьПараметр("Товары",ТоварыДляСканирования.Выгрузить(,"Номенклатура,Серия,Характеристика") );
	Запрос.УстановитьПараметр("Склад",Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции



&НаКлиенте
Процедура ОтобразитьСтраницу( Действие) //+Лико m.shenderov 05.10.2017
	
	
	ИндексСтраницы = Новый Структура;
	ИндексСтраницы.Вставить("СтраницаСтарт",0);
	ИндексСтраницы.Вставить("СтраницаШапка",1);
	ИндексСтраницы.Вставить("СтраницаТовары",2);
	ИндексСтраницы.Вставить("СтраницаЗавершение",3);
	ИндексСтраницы.Вставить("СтраницаСообщения",4);	
	НаименованиеСтраницы = Новый Соответствие;
	НаименованиеСтраницы.Вставить(0,"СтраницаСтарт");
	НаименованиеСтраницы.Вставить(1,"СтраницаШапка");
	НаименованиеСтраницы.Вставить(2,"СтраницаТовары");
	НаименованиеСтраницы.Вставить(3,"СтраницаЗавершение");
	НаименованиеСтраницы.Вставить(4,"СтраницаСообщения");
	
	
	Если Действие="Далее" Тогда
		ИндексТекущейСтраницы=ИндексТекущейСтраницы+1;		
	ИначеЕсли Действие="Назад" и ИндексТекущейСтраницы<>4 Тогда
		ИндексТекущейСтраницы=ИндексТекущейСтраницы-1;	
	ИначеЕсли ИндексТекущейСтраницы=4 И Действие="Назад" Тогда
		ИндексТекущейСтраницы=ИндексПердыдущейСтраницы;
	ИначеЕсли ИндексСтраницы[Элементы.Страницы.ТекущаяСтраница.Имя]<>0 И ИндексТекущейСтраницы<>0 Тогда
		ИндексТекущейСтраницы=ИндексСтраницы[Элементы.Страницы.ТекущаяСтраница.Имя];
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница=Элементы[НаименованиеСтраницы[ИндексТекущейСтраницы]];
	
	Если   ИндексТекущейСтраницы=3 Или ИндексТекущейСтраницы=4 Тогда
		Элементы.СканированиеДалее.Видимость=Ложь; 
	Иначе
		Элементы.СканированиеДалее.Видимость=Истина; 
	КонецЕсли;
	
	Если   ИндексТекущейСтраницы=1 Тогда 
		Элементы.СканированиеНазад.Видимость=Ложь; 
	Иначе
		Элементы.СканированиеНазад.Видимость=Истина; 
	КонецЕсли;
	
	Если  ИндексТекущейСтраницы=0 Тогда
		Элементы.ГруппаКонпокПеремещенияПоСтраницам.Видимость=Ложь;
	Иначе
		Элементы.ГруппаКонпокПеремещенияПоСтраницам.Видимость=Истина;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 05.10.2017


&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоШтрихкодуТабличногоДокументаСервер(Штрихкод) //+Лико m.shenderov 05.10.2017
	
	Менеджеры = Новый Массив;	
	Менеджеры.Добавить(Документы.ОтборРазмещениеТоваров.ПустаяСсылка());  	
	Массив= ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод,Менеджеры);
	
	Если Массив.Количество()=0 или Не ОбщегоНазначения.ЭтоДокумент(Массив[0].Метаданные()) Тогда
		Возврат Неопределено;
	Иначе
		Возврат Массив[0]; 
	КонецЕсли;
	
	
	
	
КонецФункции  //-Лико m.shenderov 05.10.2017

&НаСервере
Процедура ЗаполнитьПоДокументу() //+Лико m.shenderov 05.10.2017
	
	ТипОперацииСервер();
	
	Склад			=ДокументОснование.Склад;	
	Получатель		= ДокументОснование.Распоряжение.Получатель ; 	
	ТоварыДляСканирования.Загрузить(ДокументОснование.ТоварыОтбор.Выгрузить());	
	
КонецПроцедуры  //-Лико m.shenderov 05.10.2017

&НаСервере
Процедура ОбновитьСписокЗаданийОбработчикОжиданияНаСервере()
	
	РабочееМестоРаботникаСкладаСервер.ОбновитьСписокЗаданийОбработчикОжидания(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура НачатьПодключениеОборудованиеПриОткрытииФормыЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		
		ПриОшибкеПодключенияОборудованияНаСервере(РезультатВыполнения.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриОшибкеПодключенияОборудованияНаСервере(ОписаниеОшибки)
	
	РабочееМестоРаботникаСкладаСервер.ПриОшибкеПодключенияОборудования(ЭтаФорма, ОписаниеОшибки);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЕстьНаСкладе(Структура,Склад) 
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТекстСообщения","");
	Массив = Новый Массив();
	
	
	
	ТекстСообщения="";	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Серия = &Серия
	|				И Ячейка.Владелец = &Склад) КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток >= &Количество";
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Номенклатура",Структура.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Структура.Характеристика);
	Запрос.УстановитьПараметр("Серия",Структура.Серия);
	Запрос.УстановитьПараметр("Количество",Структура.КоличествоУпаковок);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если    РезультатЗапроса.Пустой() Тогда 		
		
		СтруктураДанных.ТекстСообщения=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru ='Товар %1 %2 %3 в количестве %4 не найден на складе!' "),Структура.Номенклатура,Структура.Характеристика,Структура.Серия,Структура.КоличествоУпаковок); 	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл  			
			СтруктураВыборка = Новый Структура;	
			СтруктураВыборка.Вставить("Номенклатура",	Выборка.Номенклатура);
			СтруктураВыборка.Вставить("Характеристика",	Выборка.Характеристика);
			СтруктураВыборка.Вставить("Серия",			Выборка.Серия);
			СтруктураВыборка.Вставить("Упаковка",		Выборка.Упаковка);
			СтруктураВыборка.Вставить("Ячейка",			Выборка.Ячейка);
			Массив.Добавить(СтруктураВыборка);				
		КонецЦикла; 		
	КонецЕсли;
	СтруктураДанных.Вставить("Таблица",Массив);

	Возврат СтруктураДанных;	
	
КонецФункции 

&НаСервере
Процедура ТипОперацииСервер()
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ТипОперации= "Перемещение";
	ИначеЕсли  ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ОтборРазмещениеТоваров") И 
		ДокументОснование.ВидОперации=Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор Тогда
		ТипОперации= "Отбор";	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
